/* 
 * File:   main1002.cpp
 * Author: dImOndTH
 *
 * Created on 10 มกราคม 2558, 18:58 น.
 */

#include "Header1002.h"

using namespace std;

/*
 โจทย์ 1002 : ROMAN
    นำเลขโรมันมาแทนเลขหน้าหนังสือที่เป็นตัวเลข แล้วส่งออกค่าว่าเลขโรมันตั้งแต่หน้าแรกจนถึงหน้าที่รับค่าเข้าไป  
 มีตัวโรมันทั้งหมดกี่ตัว 
 * : ซึ่งประกอบด้วยตัว  ‘i’ ‘v’ ‘x’ ‘l’ และ ‘c’ ซึ่งใช้แทนจำนวนเต็มค่ำ 1 5 10 50 และ 100 ตำมลำดับ
 * 
 * 
 * 
 อัลกอริทึ่ม
 1.รับเลขหน้าหนังสือจากคีย์บอร์ด(Standard Input) ซึ่งเป็นจำนวนเต็มบวก d :โจทย์กำหนด  1<=d<400
 2.สร้าง string TXT สำหรับเก็บตัวอักษรทั้งหมดที่ประมวลผลได้ เช่น รับค่าจากแป้นพิมพ์ 3 ซึ่งวนเก็บค่า คือ i+ii+iii 
 3.นำค่า TXT มาแยกออกทีละ ตัว เพื่อนำไปนับจำนวนตัวอักษร
 4.แสดงตัวอักษรที่ประมวลผลได้ออกทางหน้าจอทีละตัว เรียกจาก ‘i’ ‘v’ ‘x’ ‘l’ และ ‘c’ ตามลำดับ
 
 
 */
int main(int argc, char** argv) {
    string TXT; //text ที่ไช้เก็บข้อมูลทั้งหมด
    int page; //ไช้เก็บเลขหน้าจากคีย์บอร์ด
    int NumLoopAddTXT;
    const int i=1,v=5,x=10,l=50,c=100; // ประกาศค่าคงที่ เลขโรมัน กับ เลขอารบิก
    
    cout << "You Want Page ? : " ;
    cin>>page;
    
    if(page<5){
        if(page<=3){
            for(NumLoopAddTXT=0;NumLoopAddTXT<=page;NumLoopAddTXT++){
            TXT = "i";
            }
        }
        if(page==4){
            TXT = "iv";
        }
    }
    return 0;
}

